R2>en
R2#confi t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#ip dhcp ex
% Incomplete command.
R2(config)#ip dhcp ex
% Incomplete command.
R2(config)#ip dhcp ex
% Incomplete command.
R2(config)#ip dhcp excluded-address
% Incomplete command.
R2(config)#ip dhcp excluded-address 192.168.10.1
R2(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
R2(config)#ip dhcp excluded-address 192.168.30.1 192.168.30.10
R2(config)#ip dhcp pool R1-LAN
R2(dhcp-config)#network 192.168.10.0 255.255.255.0
R2(dhcp-config)#def
R2(dhcp-config)#default-router 192.168.10.1
R2(dhcp-config)#dns
R2(dhcp-config)#default-router 192.168.20.254
R2(dhcp-config)#exit
R2(config)#ip dhcp pool R3-LAN
R2(dhcp-config)#network 192.168.30.0 255.255.255.0
R2(dhcp-config)#def
R2(dhcp-config)#default-router 192.168.30.1
R2(dhcp-config)#dns
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#
R2(dhcp-config)#exit
R2(config)#ip dhcp pool R3-LAN
R2(dhcp-config)#network 192.168.30.0 255.255.255.0
R2(dhcp-config)#def
R2(dhcp-config)#default-router 192.168.30.1
R2(dhcp-config)#dns
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#int
R2(dhcp-config)#inter
R2(dhcp-config)#interface gig
R2(dhcp-config)#interface gigabit
R2(dhcp-config)#exit
R2(config)#int
R2(config)#interface giga
R2(config)#interface gigabitEthernet 0/1
R2(config-if)#ip add
R2(config-if)#ip address dhcp
R2(config-if)#no shutdown
R2>en
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#ip dhcp ex
R2(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
R2(config)#ip dhcp excluded-address 192.168.30.1 192.168.30.10
R2(config)#ip dhcp pool R1-LAN
R2(dhcp-config)#network 192.168.10.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.10.1
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#
R2(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

R2(config-if)#
R2(config-if)#exit
R2(config)#exit
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0     192.168.20.1    YES manual up                    up 
GigabitEthernet0/1     209.165.200.231 YES DHCP   up                    up 
Serial0/0/0            10.1.1.2        YES manual up                    up 
Serial0/0/1            10.2.2.2        YES manual up                    up 
Serial0/1/0            unassigned      YES unset  down                  down 
Serial0/1/1            unassigned      YES unset  down                  down 
Vlan1                  unassigned      YES unset  administratively down down
R2#

R1>en
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int
R1(config)#interface gigabitEthernet 0/0
R1(config-if)#ip help
R1(config-if)#ip helper-address 10.1.1.2
R1(config-if)#


R3>en
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int
R3(config)#interface giga
R3(config)#interface gigabitEthernet 0/0
R3(config-if)#ip hel
R3(config-if)#ip help
R3(config-if)#ip helper-address 10.2.2.2
R3(config-if)#